#include "SecondaryFunction.h"
#include "shape.h"
#include "transform.h"

/*
Задание 1
«Геометрические фигуры»

Представлен класс, описывающий геометрические фигуры:
- линия
- прямоугольник
- параллелепипед

И класс, описывающий геометрические преобразования фигур:
- смещения по осям x,y,z
- масштабирование по отдельным осям
- полное масштабирование

Необходимо выделить из кода «плохие запахи» и провести
рефакторинг кода, приведя его к корректному виду.
*/

int main(int argc, char** argv)
{
	printHeader(L"Геометрические фигуры");

	std::wcout << "\n";

	return 0;
}
